In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn

In [4]:
df =pd.DataFrame(randn(4,3),["a","b","c","d"],["c1","c2","c3"])

In [5]:
df

         c1        c2        c3
a -0.237071  0.203159 -0.412746
b -0.891545  1.125709  0.840647
c -1.014030  0.970819  1.437016
d -0.069397  0.471443 -0.902462

In [6]:
df>-1   #condition return Boolean

      c1    c2    c3
a   True  True  True
b   True  True  True
c  False  True  True
d   True  True  True

In [7]:
booleanDf =df>0

In [8]:
booleanDf

      c1    c2     c3
a  False  True  False
b  False  True   True
c  False  True   True
d  False  True  False

In [9]:
df[booleanDf]

   c1        c2        c3
a NaN  0.203159       NaN
b NaN  1.125709  0.840647
c NaN  0.970819  1.437016
d NaN  0.471443       NaN

In [11]:
df[df>0]

   c1        c2        c3
a NaN  0.203159       NaN
b NaN  1.125709  0.840647
c NaN  0.970819  1.437016
d NaN  0.471443       NaN

In [12]:
df

         c1        c2        c3
a -0.237071  0.203159 -0.412746
b -0.891545  1.125709  0.840647
c -1.014030  0.970819  1.437016
d -0.069397  0.471443 -0.902462

In [13]:
df["c2"]

a    0.203159
b    1.125709
c    0.970819
d    0.471443
Name: c2, dtype: float64

In [14]:
df[df["c3"]>0]                            #!!!

         c1        c2        c3
b -0.891545  1.125709  0.840647
c -1.014030  0.970819  1.437016

In [15]:
df["c2"]>0.7

a    False
b     True
c     True
d    False
Name: c2, dtype: bool

In [17]:
df[df["c2"]>0.7]

         c1        c2        c3
b -0.891545  1.125709  0.840647
c -1.014030  0.970819  1.437016

In [18]:
df[df["c2"]>0.1]

         c1        c2        c3
a -0.237071  0.203159 -0.412746
b -0.891545  1.125709  0.840647
c -1.014030  0.970819  1.437016
d -0.069397  0.471443 -0.902462

In [26]:
df[(df["c2"]>0) & (df["c3"]>0) ]

         c1        c2        c3
b -0.891545  1.125709  0.840647
c -1.014030  0.970819  1.437016

In [27]:
df[(df["c2"]>0) | (df["c3"]>0) ]

         c1        c2        c3
a -0.237071  0.203159 -0.412746
b -0.891545  1.125709  0.840647
c -1.014030  0.970819  1.437016
d -0.069397  0.471443 -0.902462

In [28]:
df

         c1        c2        c3
a -0.237071  0.203159 -0.412746
b -0.891545  1.125709  0.840647
c -1.014030  0.970819  1.437016
d -0.069397  0.471443 -0.902462

In [31]:
df["c4"]=randn(4)               #df["c4"]=pd.Series(randn(4),["a","b","c","d"])

In [32]:
df

         c1        c2        c3        c4
a -0.237071  0.203159 -0.412746 -0.513746
b -0.891545  1.125709  0.840647  1.768038
c -1.014030  0.970819  1.437016 -0.776457
d -0.069397  0.471443 -0.902462  0.328315

In [33]:
df["c5"]=["value1","value2","value3","value4"]

In [34]:
df

         c1        c2        c3        c4      c5
a -0.237071  0.203159 -0.412746 -0.513746  value1
b -0.891545  1.125709  0.840647  1.768038  value2
c -1.014030  0.970819  1.437016 -0.776457  value3
d -0.069397  0.471443 -0.902462  0.328315  value4

In [35]:
df.set_index("c5")

              c1        c2        c3        c4
c5
value1 -0.237071  0.203159 -0.412746 -0.513746
value2 -0.891545  1.125709  0.840647  1.768038
value3 -1.014030  0.970819  1.437016 -0.776457
value4 -0.069397  0.471443 -0.902462  0.328315

In [36]:
df

         c1        c2        c3        c4      c5
a -0.237071  0.203159 -0.412746 -0.513746  value1
b -0.891545  1.125709  0.840647  1.768038  value2
c -1.014030  0.970819  1.437016 -0.776457  value3
d -0.069397  0.471443 -0.902462  0.328315  value4

In [37]:
df.set_index("c5",inplace=True)

In [38]:
df

              c1        c2        c3        c4
c5
value1 -0.237071  0.203159 -0.412746 -0.513746
value2 -0.891545  1.125709  0.840647  1.768038
value3 -1.014030  0.970819  1.437016 -0.776457
value4 -0.069397  0.471443 -0.902462  0.328315

In [39]:
df.index.names

FrozenList(['c5'])